let munObjData = {
	"Муниципальное образование «Боброво-Лявленское»":{
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Кузьмино»":{
			"circles":[[64.384122, 40.952221]],
			"link":"objects\\Боброво_Лявленское\\1ФАП Кузьмино.docx"
		},
		"ГБСУ АО «Трепузовский психоневрологический интернат»":{
			"circles":[[64.364531, 41.057263]],
			"coord":[[64.364552, 41.057315], [64.364229, 41.055964], [64.363505, 41.053916], [64.362855, 41.055407], [64.361712, 41.058993], [64.361831, 41.059583], [64.362407, 41.060259], [64.362903, 41.059916], [64.363384, 41.059256], [64.363326, 41.059004]],
			"link":"objects\\Боброво_Лявленское\\2Трепузовский.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Лявля»":{
			"circles":[[64.377408, 41.023082]],
			"link":"objects\\Боброво_Лявленское\\3 ФАП Косково.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Лявля»":{
			"circles":[[64.347362, 41.353111]],
			"link":"objects\\Боброво_Лявленское\\3 ФАП Лявля.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Лявля»":{
			"circles":[[64.377382, 41.023102]],
			"link":"objects\\Боброво_Лявленское\\3 ФАП Лявля.docx"
		},
		"ГБУЗ АО Приморская ЦРБ «Врачебная амбулатория Боброво»":{
			"circles":[[64.356271, 41.152864]],
			"link":"objects\\Боброво_Лявленское\\4 Амбулатория Боброво.docx"
		},
		"МБОУ «Бобровская СОШ» филиал Лявленская начальная школа-детский сад":{
			"circles":[[64.385344, 41.028002], [64.385940, 41.027255], [64.386152, 41.028867]],
			"coord":[[64.385344, 41.028002], [64.385389, 41.028683], [64.386215, 41.028863], [64.386250, 41.028579], [64.386266, 41.028278], [64.385950, 41.027171]],
			"link":"objects\\Боброво_Лявленское+\\5 Детский сад Лявля.docx"
		},
		"Хоккейная площадка":{
			"circles":[[64.355425, 41.153505]],
			"coord":[[64.355476, 41.153511], [64.355077, 41.153368], [64.355035, 41.153438], [64.354998, 41.153864], [64.355021, 41.153952], [64.355418, 41.154124], [64.355467, 41.154030], [64.355508, 41.153593]],
			"link":"objects\\Боброво_Лявленское\\8 Хоккейная площадка Боброво.docx"
		},
		"Волебольная площадка":{
			"circles":[[64.384468, 41.023233]],
			"coord":[[64.384463, 41.023192], [64.384466, 41.023294], [64.384245, 41.023669], [64.384190, 41.023219]],
			"link":"objects\\Боброво_Лявленское\\10 Волебольная площадка у ДК д. Новинки.docx"
		},
		"Тренажерный зал":{
			"circles":[[64.384530, 41.023296]],
			"link":"objects\\Боброво_Лявленское\\11 Тренажерный зал в ДК д. Новинки.docx"
		},
		"МБОУ \"Бобровская СШ\"":{
			"circles":[[64.355441, 41.159274], [64.355318, 41.159295], [64.355028, 41.159322], [64.354367, 41.158974], [64.355004, 41.160749]],
			"coord":[[64.355655, 41.161033], [64.354135, 41.160288], [64.354279, 41.158925], [64.355021, 41.159295], [64.355744, 41.159236]],
			"link":"objects\\Боброво_Лявленское+\\Бобровская СШ.docx"
		}
	},
	"Муниципальное образование «Заостровское»":{
		"Филиал ГБУЗ «Приморская ЦРБ»":{
			"circles":[[64.480806, 40.506659], [64.480242, 40.507121]],
			"coord":[[64.480199, 40.507062], [64.480002, 40.505111], [64.480169, 40.505005], [64.480266, 40.505077], [64.480885, 40.504774], [64.480928, 40.505272], [64.480810, 40.505369], [64.480937, 40.506404], [64.480880, 40.506616], [64.480261, 40.507134]],
			"link":"objects\\Заостровское\\1Заостровская больница.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Луговой»":{
			"circles":[[64.510236, 40.433643]],
			"link":"objects\\Заостровское\\2 ФАП п. Луговой.docx"
		},
		"МБОУ «Заостровская СШ» структурное подразделение «Детский сад с. Заостровье»":{
			"circles":[[64.482514, 40.506841]],
			"coord":[[64.482523, 40.506733], [64.482432, 40.505303], [64.482410, 40.505258], [64.481898, 40.505480], [64.481809, 40.505641], [64.481897, 40.507116], [64.482476, 40.506961]],
			"link":"objects\\Заостровское\\3 Детский сад Заостровье.docx"
		},
		"МБОУ «Заостровская СШ» (здание начальной школы)":{
			"circles":[[64.481378, 40.50937], [64.481388, 40.507445]],
			"coord":[[64.481630, 40.507595], [64.481133, 40.507284], [64.480920, 40.509167], [64.481424, 40.509390]],
			"link":"objects\\Заостровское\\4 Начальная школа. Заостровье.docx"
		},
		"МБОУ «Заостровская СШ»":{
			"circles":[[64.480828, 40.509985], [64.481613, 40.511350], [64.480118, 40.513856]],
			"coord":[[64.479928, 40.514234], [64.481619, 40.511373], [64.481070, 40.510182], [64.480652, 40.509839], [64.479365, 40.512228]],
			"link":"objects\\Заостровское\\5 Школа в д. Рикасово.docx"
		},
		"Тренажерный зал":{
			"circles":[[64.484346, 40.506686]],
			"link":"objects\\Заостровское\\7 Тренажерный зал. Заостровье.docx"
		}
	},
	"Муниципальное образование «Катунинское»":{
		"Структурное подразделение «Детский сад п.Катунино» МБОУ «Катунинская СШ»":{
			"circles":[[64.389969, 40.624572]],
			"coord":[[64.390356, 40.623936], [64.390071, 40.623689], [64.389876, 40.625336], [64.390335, 40.625317], [64.390468, 40.624427], [64.390320, 40.624311]],
			"link":"objects\\Катунинское\\1. Детсад Катунино.docx"
		},
		"ГБУЗ АО «Приморская ЦРБ» Врачебная амбулатория «Катунино»":{
			"circles":[[64.389613, 40.625167]],
			"link":"objects\\Катунинское\\2. Амбулатория Катунино.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Беломорье»":{
			"circles":[[64.292950, 40.892659]],
			"link":"objects\\Катунинское\\2 ФАП Беломорье.docx"
		},
		"МБУ ДО «Приморская детская школа искусств»":{
			"circles":[[64.389714, 40.624419]],
			"link":"objects\\Катунинское\\3. ДШИ.docx"
		},
		"МБОУ «Катунинская СШ» (основная школа)":{
			"circles":[[64.391490, 40.623859], [64.393305, 40.623233], [64.392213, 40.624410]],
			"coord":[[64.391490, 40.623859], [64.392924, 40.624880], [64.393125, 40.624845], [64.393088, 40.624084], [64.393120, 40.624054], [64.393116, 40.623904], [64.393292, 40.623810], [64.393305, 40.623233], [64.392795, 40.622112], [64.392539, 40.622110], [64.392276, 40.622616], [64.392232, 40.623062], [64.392232, 40.623062], [64.391550, 40.623483]],
			"link":"objects\\Катунинское\\4. Катунинская СШ_осн_школа.docx"
		},
		"МБОУ «Катунинская СШ» (начальная школа)":{
			"circles":[[64.388362, 40.630605]],
			"link":"objects\\Катунинское\\5. Катунинская СШ - начальная шк.docx"
		},
		"Филиал «Детский сад д.Лахта» МБОУ «Катунинская СШ»":{
			"circles":[[64.394520, 40.617782], [64.394993, 40.618600]],
			"coord":[[64.394521, 40.617849], [64.394809, 40.618560], [64.394809, 40.618560], [64.395290, 40.618244], [64.395325, 40.617871], [64.395085, 40.617136], [64.394765, 40.617112], [64.394534, 40.617420]],
			"link":"objects\\Катунинское\\6. Детсад Лахта.docx"
		},
		"Учреждение «Базовый санаторий «Беломорье»":{
			"circles":[[64.292950, 40.892659]],
			"link":"objects\\Катунинское\\7. Санаторий Беломорье.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Беломорье»":{
			"circles":[[64.292952, 40.892653]],
			"link":"objects\\Катунинское\\8. ФАП Беломорье.docx"
		}
	},
	"Муниципальное образование «Лисестровское»":{
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Лисестровское»":{
			"circles":[[64.464608, 40.638105]],
			"link":"objects\\Лисестровское\\1. ФАП Лисестровское.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Васьково»":{
			"circles":[[64.413768, 40.460850]],
			"link":"objects\\Лисестровское\\2. ФАП Васьково.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Ширшинский ЗВЕРОСОВХОЗ»":{
			"circles":[[64.410137, 40.741562], [64.410144, 40.742053], [64.409601, 40.741468]],
			"coord":[[64.410139, 40.741460], [64.409584, 40.741479], [64.409580, 40.742625], [64.410144, 40.742606]],
			"link":"objects\\Лисестровское\\3. ФАП Ширшинский зверосовхоз.docx"
		},
		"ГБСУ АО «Ширшинский психоневрологический интернат»":{
			"circles":[[64.413179, 40.755218], [64.413242, 40.753769]],
			"coord":[[64.414049, 40.753198], [64.414018, 40.753184], [64.412995, 40.753935], [64.413194, 40.755336], [64.413250, 40.755368], [64.413437, 40.756891], [64.414757, 40.755929], [64.414647, 40.755041], [64.414319, 40.755250]],
			"link":"objects\\Лисестровское\\4. Ширшинский интернат.docx"
		},
		"Филиал «Детский сад п.Ширшинский» МБОУ «Катунинская СШ»":{
			"circles":[[64.410137, 40.741562], [64.410144, 40.742053], [64.409601, 40.741468]],
			"coord":[[64.410139, 40.741460], [64.409584, 40.741479], [64.409580, 40.742625], [64.410144, 40.742606]],
			"link":"objects\\Лисестровское\\5. Ширшинский детсад.docx"
		},
		"МБОУ «Васьковская СШ»":{
			"circles":[[64.412372, 40.454126], [64.412201, 40.453573], [64.412630, 40.454462], [64.412533, 40.454629], [64.413788, 40.453338]],
			"link":"objects\\Лисестровское\\6.1 Васьковская СШ_осн_зд.docx"
		},
		"МБОУ «Васьковская СШ» (начальная школа)":{
			"circles":[[64.409858, 40.454936]],
			"link":"objects\\Лисестровское\\6.2. Васьковская СШ_начальная шк.docx"
		},
		"Структурное подразделение «Детский сад п. Васьково» МБОУ «Васьковская СШ»":{
			"circles":[[64.412583, 40.464056]],
			"coord":[[64.412229, 40.462254], [64.411703, 40.462938], [64.411703, 40.462938], [64.412533, 40.464224], [64.412598, 40.463969], [64.412578, 40.463610]],
			"link":"objects\\Лисестровское\\7. Детсад Васьково.docx"
		},
		"Филиал «Детская школа искусств п.Васьково» МБУ ДО «Приморская ДШИ»":{
			"circles":[[64.409858, 40.454936]],
			"link":"objects\\Лисестровское\\8. ДШИ Васьково.docx"
		},
		"Спортивная площадка":{
			"circles":[[64.412372, 40.454126], [64.412201, 40.453573], [64.412630, 40.454462], [64.412533, 40.454629], [64.413788, 40.453338]],
			"link":"objects\\Лисестровское\\9. Спортплощадка Васьково.docx"
		},
		"Футбольное поле":{
			"circles":[[64.412372, 40.454126], [64.412201, 40.453573], [64.412630, 40.454462], [64.412533, 40.454629], [64.413788, 40.453338]],
			"link":"objects\\Лисестровское\\10. Футбольное поле Васьково.docx"
		},
		"Спортивный зал (п. Васьково)":{
			"circles":[[64.412372, 40.454126], [64.412201, 40.453573], [64.412630, 40.454462], [64.412533, 40.454629], [64.413788, 40.453338]],
			"link":"objects\\Лисестровское\\11. Спортзал.docx"
		},
		"Футбольное поле (д. Окулово)":{
			"circles":[[64.464538, 40.636331]],
			"link":"objects\\Лисестровское\\13. Футбольное поле Окулово.docx"
		},
		"Аэропорт АО «2-ой Архангельский объединенный авиаотряд»":{
			"circles":[[64.442930, 40.429789]],
			"link":"objects\\Лисестровское\\14. Аэропорт.docx"
		},
		"Войсковая часть №10488 Ш":{
			"circles":[[64.445694, 40.704936], [64.439326, 40.706536], [64.442790, 40.717319]],
			"coord":[[64.447151, 40.704367], [64.445694, 40.704936], [64.442828, 40.705351], [64.439480, 40.705276], [64.438952, 40.709622], [64.439281, 40.711692], [64.443052, 40.713971], [64.442806, 40.717269], [64.444396, 40.716528], [64.444396, 40.716528], [64.447375, 40.713771]],
			"link":"objects\\Лисестровское\\15. ВЧ 10488Ш.docx"
		}
	},
	"Муниципальное образование «Островное»":{
		"Филиал ГБУЗ АО «Приморская ЦРБ»  ФАП «Вознесенье»":{
			"circles":[[64.571243, 40.341504]],
			"link":"objects\\Островное\\1. ФАП Вознесение.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ»  ФАП «Ластола»":{
			"circles":[[64.600304, 40.295031]],
			"link":"objects\\Островное\\2 ФАП Ластола.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ»  ФАП «Пустошь»":{
			"circles":[[64.586020, 40.438156], [64.585939, 40.438516]],
			"link":"objects\\Островное\\3. ФАП Пустошь.docx"
		},
		"МБОУ «Ластольская СШ»":{
			"circles":[[64.598574, 40.286795], [64.598065, 40.287409]],
			"coord":[[64.598844, 40.286451], [64.597968, 40.287519], [64.597495, 40.285056], [64.598263, 40.284118]],
			"link":"objects\\Островное\\4. МБОУ Ластольская СШ.docx"
		},
		"Структурное подразделение «Детский сад д. Ластола»  МБОУ \"Ластольская СШ\"":{
			"circles":[[64.598574, 40.286795], [64.598065, 40.287409]],
			"coord":[[64.598844, 40.286451], [64.597968, 40.287519], [64.597495, 40.285056], [64.598263, 40.284118]],
			"link":"objects\\Островное\\5. ДС Ластола.docx"
		},
		"Филиал \"Пустошинская средняя школа - детский сад\" МБОУ \"Ластольская СШ\"":{
			"circles":[[64.586046, 40.437851], [64.585667, 40.436486]],
			"coord":[[64.585726, 40.436415], [64.585234, 40.436970], [64.585472, 40.438067], [64.585491, 40.438046], [64.585565, 40.438400], [64.585593, 40.438435], [64.586050, 40.437899]],
			"link":"objects\\Островное\\6. Пустошь школа-сад.docx"
		},
		"Филиал \"Вознесенская средняя школа - детский сад\" МБОУ \"Ластольская СШ\"":{
			"circles":[[64.574249, 40.340680]],
			"link":"objects\\Островное\\7. Вознесение школа-сад.docx"
		},
		"Помещение для занятия физкультурой":{
			"circles":[[64.589232, 40.439763], [64.589212, 40.440200]],
			"link":"objects\\Островное\\8. Помещение для занятия физкультурой д.Одиночка.docx"
		}
	},
	"Муниципальное образование «Пертоминское»":{
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Пертоминск»":{
			"circles":[[64.794183, 38.409982]],
			"link":"objects\\Пертоминское\\1. ФАП Пертоминск.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Лопшеньга»":{
			"circles":[[64.972792, 37.690320]],
			"link":"objects\\Пертоминское\\2. ФАП Лопшеньга.docx"
		},
		"ГБУЗ АО «Приморская ЦРБ» ФАП «Уна-Луда»":{
			"circles":[[64.643715, 38.152048]],
			"link":"objects\\Пертоминское\\3 ФАП Уна_Луда.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Летняя Золотица»":{
			"circles":[[64.951865, 36.822891]],
			"link":"objects\\Пертоминское\\5. ФАП Летняя Золотица.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Пушлахта»":{
			"circles":[[64.810061, 36.575469]],
			"link":"objects\\Пертоминское\\6. ФАП Пушлахта.docx"
		},
		"МБОУ «Пертоминская СШ»":{
			"circles":[[64.792367, 38.416620], [64.792420, 38.417199]],
			"link":"objects\\Пертоминское\\7. Пертоминская СШ.docx"
		},
		"Структурное подразделение «Детский сад п.Пертоминск» МБОУ «Пертоминская СШ»":{
			"circles":[[64.796882, 38.405085], [64.796319, 38.403658]],
			"coord":[[64.797206, 38.404698], [64.796507, 38.405396], [64.796223, 38.403615], [64.796914, 38.402928]],
			"link":"objects\\Пертоминское\\8. Пертоминский ДС.docx"
		},
		"Филиал «Лудская начальная школа» МБОУ «Пертоминская СШ»":{
			"circles":[[64.643705, 38.151920]],
			"coord":[[64.644119, 38.152317], [64.643825, 38.151727], [64.643701, 38.151899], [64.643613, 38.152135], [64.643944, 38.152832]],
			"link":"objects\\Пертоминское\\9. Лудская нач_школа.docx"
		},
		"МБОУ «Летне-Золотицкая ОШ»":{
			"circles":[[64.952779, 36.822313], [64.952784, 36.822528], [64.952675, 36.822420]],
			"link":"objects\\Пертоминское\\10. Летне Золотицкая ОШ.docx"
		},
		"Структурное подразделение «Детский сад д. Летняя Золотица»":{
			"circles":[[64.952552, 36.823493], [64.952415, 36.823407]],
			"link":"objects\\Пертоминское\\11. Летне Золотицкая ОШ.docx"
		},
		"МБОУ «Лопшеньгская ОШ»":{
			"circles":[[64.976020, 37.690784], [64.975224, 37.690459]],
			"coord":[[64.976405, 37.690834], [64.976428, 37.689375], [64.975251, 37.689257], [64.975247, 37.690652]],
			"link":"objects\\Пертоминское\\12. Лопшеньгская ОШ.docx"
		},
		"Структурное подразделение «Пришкольный интернат» МБОУ «Лопшеньгская ОШ»":{
			"circles":[[64.976569, 37.690513]],
			"link":"objects\\Пертоминское\\13. Лопшеньгский интернат.docx"
		},
		"Структурное подразделение «Детский сад д.Лопшеньга» МБОУ «Лопшеньгская ОШ»":{
			"circles":[[64.976020, 37.690784], [64.975224, 37.690459]],
			"coord":[[64.976405, 37.690834], [64.976428, 37.689375], [64.975251, 37.689257], [64.975247, 37.690652]],
			"link":"objects\\Пертоминское\\14. Лошеньга ДС.docx"
		},
		"Спортивная площадка для футбола и волейбола":{
			"circles":[[64.976020, 37.690784], [64.975224, 37.690459]],
			"coord":[[64.976405, 37.690834], [64.976428, 37.689375], [64.975251, 37.689257], [64.975247, 37.690652]],
			"link":"objects\\Пертоминское\\15. Спортплощадка.docx"
		},
		"Аэропорт АО «2-ой Архангельский объединенный авиаотряд» п. Пертоминск":{
			"circles":[[64.789502, 38.421572]],
			"link":"objects\\Пертоминское\\16. Аэропорт Пертоминск.docx"
		},
		"Аэропорт АО «2-ой Архангельский объединенный авиаотряд» д. Летняя Золотица":{
			"circles":[[64.953189, 36.822120]],
			"link":"objects\\Пертоминское\\17. Аэропорт Летняя Золотица.docx"
		},
		"Аэропорт АО «2-ой Архангельский объединенный авиаотряд» д. Лопшеньга":{
			"circles":[[64.976731, 37.692451]],
			"link":"objects\\Пертоминское\\18. Аэропорт Лопшеньга.docx"
		}
	},
	"Муниципальное образование «Приморское»":{
		"ГБУЗ «Приморская ЦРБ» Врачебная амбулатория «Рикасиха»":{
			"circles":[[64.537458, 40.169560], [64.536488, 40.170140]],
			"coord":[[64.536744, 40.168796], [64.536350, 40.170915], [64.537199, 40.171709], [64.537521, 40.169775], [64.537436, 40.169515]],
			"link":"objects\\Приморское\\1. Амбулатория Рикасиха.docx"
		},
		"МБОУ «Приморская СШ» (здание школы)":{
			"circles":[[64.537204, 40.166528], [64.537957, 40.164596]],
			"coord":[[64.537571, 40.164224], [64.537167, 40.166488], [64.537841, 40.167147], [64.537922, 40.167078], [64.538289, 40.165125], [64.538400, 40.165179], [64.538400, 40.165179], [64.538421, 40.165041]],
			"link":"objects\\Приморское\\2.1. Основная школа Рикасиха.docx"
		},
		"МБОУ «Приморская СШ» (здание начальной школы)":{
			"circles":[[64.538055, 40.163678]],
			"link":"objects\\Приморское\\2.2. Начальная  школа Рикасиха.docx"
		},
		"МБОУ «Приморская СШ» Структурное подразделение «Детский сад д. Рикасиха»":{
			"circles":[[64.537458, 40.169560], [64.536488, 40.170140]],
			"coord":[[64.536744, 40.168796], [64.536350, 40.170915], [64.537199, 40.171709], [64.537521, 40.169775], [64.537436, 40.169515]],
			"link":"objects\\Приморское\\3. Детский сад Рикасиха.docx"
		},
		"МБОУ «Приморская СШ» филиал «Лайдокский детский сад»":{
			"circles":[[64.534048, 40.251259], [64.533448, 40.251227]],
			"coord":[[64.533449, 40.251068], [64.534040, 40.251162], [64.534052, 40.251229], [64.534040, 40.251498], [64.533664, 40.252101], [64.533494, 40.251862], [64.533497, 40.251726], [64.533440, 40.251661]],
			"link":"objects\\Приморское\\4. Детский сад Лайский Док.docx"
		},
		"МБУДО «Приморская ДЮСШ»":{
			"circles":[[64.537923, 40.159467]],
			"link":"objects\\Приморское\\5 6 Приморская ДЮСШ.docx"
		},
		"Спортивная площадка «Городок здоровья»":{
			"circles":[[64.533201, 40.249902]],
			"coord":[[64.533068, 40.249773], [64.533068, 40.249773], [64.533033, 40.250363], [64.533141, 40.250419], [64.533170, 40.250068], [64.533170, 40.250068], [64.533208, 40.249824]],
			"link":"objects\\Приморское\\7. Спортивная площадка Городок здоровья.docx"
		},
		"Хоккейный корт «Дельфин»":{
			"circles":[[64.533487, 40.250975]],
			"link":"objects\\Приморское\\8. Хоккейный корт Дельфин.docx"
		},
		"Хоккейный корт":{
			"circles":[[64.537139, 40.167047]],
			"link":"objects\\Приморское\\9. Хоккейный корт Рикасиха.docx"
		},
		"Футбольная площадка":{
			"circles":[[64.537207, 40.169091]],
			"coord":[[64.537280, 40.168711], [64.536936, 40.168362], [64.536868, 40.168735], [64.537207, 40.169091]],
			"link":"objects\\Приморское\\10. Футбольная площадка Рикасиха.docx"
		},
		"Войсковая часть 92485":{
			"circles":[[64.520966, 40.145111]],
			"link":"objects\\Приморское\\11. ВЧ 92485.docx"
		},
		"Волейбольная площадка":{
			"circles":[[64.537647, 40.159301]],
			"coord":[[64.537662, 40.159215], [64.537605, 40.159158], [64.537562, 40.159424], [64.537619, 40.159488]],
			"link":"objects\\Приморское\\Волейбольная площадка Рикасиха.docx"
		},
		"Стадион":{
			"circles":[[64.537877, 40.167720]],
			"link":"objects\\Приморское\\Стадион Рикасиха.docx"
		}
	},
	"Муниципальное образование «Сельское поселение «Соловецкое»":{
		"ГБУЗ АО «АОКБ» филиал Соловецкая участковая больница":{
			"circles":[[65.021737, 35.708900], [65.021601, 35.710134]],
			"link":"objects\\Соловецкое\\1 Соловецкая больница.docx"
		},
		"МБОУ «Соловецкая СШ»":{
			"circles":[[65.021218, 35.704421]],
			"link":"objects\\Соловецкое\\2 Соловецкая школа.docx"
		},
		"Структурное подразделение «Детский сад п. Соловецкий»":{
			"circles":[[65.021760, 35.705044]],
			"link":"objects\\Соловецкое\\3 Соловецкий садик.docx"
		},
		"Хоккейный корт":{
			"circles":[[65.028845, 35.700732]],
			"link":"objects\\Соловецкое\\4. Хоккейный корт.docx"
		},
		"Спортивная площадка":{
			"circles":[[65.021393, 35.704830]],
			"link":"objects\\Соловецкое\\5 Спортивная площадка.docx"
		},
		"Помещение для занятий физкультурой":{
			"circles":[[65.026855, 35.714790], [65.026685, 35.714439], [65.026806, 35.715375]],
			"link":"objects\\Соловецкое\\6. Помещение для занятий физкультурой.docx"
		},
		"ООО «Архангельские региональные авиаперевозки»":{
			"circles":[[65.029879, 35.723323]],
			"link":"objects\\Соловецкое\\7 Аэропорт.docx"
		},
		"ОАО «АрхоблЭнерго» филиал «Соловецкий»":{
			"circles":[[65.021436, 35.714521], [65.020823, 35.714794], [65.020914, 35.717090]],
			"coord":[[65.021994, 35.714714], [65.020867, 35.714344], [65.020760, 35.715433], [65.020622, 35.716291], [65.020660, 35.716720], [65.020762, 35.717053], [65.020926, 35.717112], [65.021356, 35.718383], [65.022137, 35.717342]],
			"link":"objects\\Соловецкое\\7 Аэропорт.docx"
		}
	},
	"Муниципальное образование «Талажское»":{
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Талаги»":{
			"circles":[[64.622514, 40.669673]],
			"link":"objects\\Талажское\\1. ГБУЗ ФАП Талаги.docx"
		},
		"ГБУЗ АО «Архангельская клиническая психиатрическая больница-2»":{
			"circles":[[64.627627, 40.690980]],
			"coord":[[64.627478, 40.690980], [64.627468, 40.695840], [64.629204, 40.695819], [64.629215, 40.692402], [64.629878, 40.692396], [64.629883, 40.690385], [64.629321, 40.690332], [64.629328, 40.689098], [64.627725, 40.689109], [64.627719, 40.690981]],
			"link":"objects\\Талажское\\3. ГБУЗ АКПБ 2.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Повракула»":{
			"circles":[[64.618244, 40.587316], [64.617563, 40.587509], [64.617542, 40.588754], [64.617858, 40.588786], [64.618247, 40.588780]],
			"coord":[[64.618203, 40.587241], [64.617885, 40.587278], [64.617514, 40.587498], [64.617503, 40.588711], [64.617503, 40.588711], [64.618267, 40.588750], [64.618633, 40.587697], [64.618580, 40.587418]],
			"link":"objects\\Талажское\\5. ГБУЗ ФАП Повракульская.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Верхняя Золотица»":{
			"circles":[[65.690269, 40.370162], [65.690145, 40.371181]],
			"link":"objects\\Талажское\\6. ГБУЗ ФАП В.Золотица.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Нижняя Золотица»":{
			"circles":[[65.688857, 40.183279]],
			"link":"objects\\Талажское\\7. ГБУЗ ФАП Н.Золотица.docx"
		},
		"МБОУ «Талажская СШ»":{
			"circles":[[64.625318, 40.670846], [64.624128, 40.670814], [64.624187, 40.669084]],
			"coord":[[64.625354, 40.669430], [64.624125, 40.669414], [64.624125, 40.672241], [64.625325, 40.672445], [64.624178, 40.669379], [64.624192, 40.668939], [64.624574, 40.669009], [64.624572, 40.669416]],
			"link":"objects\\Талажское\\8. Талаги школа.docx"
		},
		"МБОУ «Талажская СШ» структурное подразделение «Детский сад п. Талаги»":{
			"circles":[[64.623487, 40.669234], [64.622800, 40.669234]],
			"coord":[[64.623495, 40.668592], [64.622798, 40.668598], [64.622805, 40.670186], [64.623217, 40.669846], [64.623242, 40.670152], [64.623390, 40.670189], [64.623497, 40.670186]],
			"link":"objects\\Талажское\\9. Детский сад Талаги.docx"
		},
		"МБОУ «Талажская СШ» филиал «Повракульская начальная школа - детский сад»":{
			"circles":[[64.618244, 40.587316], [64.617610, 40.587487], [64.617553, 40.588761], [64.617871, 40.588819], [64.618253, 40.588795]],
			"coord":[[64.618563, 40.587459], [64.618244, 40.587316], [64.618001, 40.587239], [64.617200, 40.587760], [64.617142, 40.588747], [64.617869, 40.588795], [64.618253, 40.588795], [64.618621, 40.587735]],
			"link":"objects\\Талажское\\10. школа - детский сад Повракульскя.docx"
		},
		"Тренажерный зал":{
			"circles":[[64.623495, 40.667621]],
			"link":"objects\\Талажское\\14. тренажерный зал Талаги.docx"
		},
		"Поле хоккейное":{
			"circles":[[64.628557, 40.641004]],
			"link":"objects\\Талажское\\16. поле хоккейное Талаги.docx"
		},
		"Производственные объекты - карьер на трубке «Архангельская»":{
			"circles":[[65.275900, 41.029312]],
			"link":"objects\\Талажское\\17. Карьер на трубке Архангельская.docx"
		},
		"Производственные объекты (карьер на трубке «Карпинского-1»)":{
			"circles":[[65.275900, 41.029312]],
			"link":"objects\\Талажское\\18. Карьер на трубке Карпинского_1.docx"
		},
		"Группа резервуаров и сливно-наливных устройств":{
			"circles":[[64.623750, 40.662004]],
			"link":"objects\\Талажское\\19. РСН_Терминалы.docx"
		},
		"Производственные объекты (карьер на трубке «Архангельская» фабрика обогатительная, карьер на трубке «Карпинского-1», дизельная электростанция, резервуарный парк по хранению нефтепродуктов дизельной электростанции)":{
			"circles":[[65.275900, 41.029312]],
			"link":"objects\\Талажское\\20. Севералмаз.docx"
		},
		"Группа резервуаров и сливно-наливных устройств":{
			"circles":[[65.677074, 40.143810]],
			"link":"objects\\Талажское\\21. ВЧ 21514.docx"
		}
	},
	"Муниципальное образование «Уемское»":{
		"ГБУЗ АО «Приморская ЦРБ» Уемская районная больница":{
			"circles":[[64.473565, 40.864479]],
			"link":"objects\\Уемское\\1 Уемская больница.docx"
		},
		"МБОУ «Уемская СШ»":{
			"circles":[[64.478826, 40.842030], [64.478238, 40.843591]],
			"coord":[[64.479041, 40.840856], [64.478520, 40.840166], [64.478226, 40.840209], [64.477522, 40.842922], [64.478358, 40.843720]],
			"link":"objects\\Уемское\\2 Уемская школа.docx"
		},
		"Филиал «Детская школа искусств п. Уемский» МБУ ДО «Приморская ДШИ»":{
			"circles":[[64.478826, 40.842030], [64.478238, 40.843591]],
			"coord":[[64.479041, 40.840856], [64.478520, 40.840166], [64.478226, 40.840209], [64.477522, 40.842922], [64.478358, 40.843720]],
			"link":"objects\\Уемское\\3 филиал Уемский ДШИ.docx"
		},
		"ГБСУ АО «Приморский СРЦН «Радуга»":{
			"circles":[[64.471922, 40.872014]],
			"coord":[[64.472672, 40.872432], [64.472184, 40.871381], [64.471665, 40.872652], [64.472154, 40.873698]],
			"link":"objects\\Уемское\\4 Центр Радуга.docx"
		},
		"Футбольная площадка":{
			"circles":[[64.474802, 40.863905]],
			"coord":[[64.475165, 40.863992], [64.474842, 40.863527], [64.474765, 40.863832], [64.475083, 40.864307]],
			"link":"objects\\Уемское\\5 Футбольная площадка Уемское.docx"
		},
		"МБОУ «Уемская СШ» Структурное подразделение «Детский сад п. Уемский»":{
			"circles":[[64.473155, 40.868829]],
			"coord":[[64.473766, 40.869864], [64.473766, 40.869864], [64.473176, 40.868780], [64.472884, 40.869478], [64.472967, 40.869633], [64.472861, 40.869864], [64.472590, 40.869671], [64.472384, 40.870159], [64.473007, 40.871554]],
			"link":"objects\\Уемское\\6 Детский сад Уемский.docx"
		},
		"Лыжный стадион им. В. С. Кузина":{
			"circles":[[64.462176, 40.943002]],
			"coord":[[64.462452, 40.943326], [64.462317, 40.943203], [64.462198, 40.942991], [64.462181, 40.942945], [64.462051, 40.941510], [64.460345, 40.939780], [64.459727, 40.944538], [64.460838, 40.949355], [64.462542, 40.949645]],
			"link":"objects\\Уемское\\7 Стадион. М. Корелы.docx"
		}
	}
}

ymaps.ready(init);

var mapCircle,
	circleCollection = {},
	pointCollection = {};

function init() {
	yMap = new ymaps.Map("map", {
		center: [64.543235, 40.537195],
		zoom: 13,
		type: 'yandex#hybrid'
	});

	circleCollection = new ymaps.GeoObjectCollection({}, {
    	fillColor: "#FF000025",
	  	strokeColor: "#FF0000",
	   	strokeWidth: 2
	});
}

function createSelect(selectElement, objectData, addData = false) {
	selectElement.html('');
	Object.keys(objectData).forEach(function (item){
		selectElement.append($('<li>').text(item));
	});
}

function closeList(listEl = $('.selectElement ul'), currentEl = $('.valueText')) {
	currentEl.children('img').css('transform', 'rotate(0)');
	listEl.css('display', 'none');
	currentEl.removeClass('active');
}

function openList(listEl, currentEl) {
	currentEl.children('img').css('transform', 'rotate(180deg)');
	listEl.css('display', 'block');
	currentEl.addClass('active');
}

createSelect($('#munForm ul'), munObjData);

$('.valueText').on('click', function() {
	closeList();
	let listEl = $(this).parent().children('ul')

	if ($(this).hasClass('active'))
		closeList(listEl, $(this));
	else
		openList(listEl, $(this));
});

$('#munForm').on('click', 'li', function() {
	createSelect($('#munObj ul'), munObjData[$(this).text()]);
	$('#munForm .valueText').children('span').text($(this).text());
	closeList();
});

$('#munObj').on('click', 'li', function() {
	circleCollection = new ymaps.GeoObjectCollection({}, {
		fillColor: "#FF000025",
		strokeColor: "#FF0000",
		strokeWidth: 2
	});


	pointCollection = new ymaps.GeoObjectCollection({
		properties: {
			iconContent: "Азербайджан"
		}
	}, {
			preset: 'islands#blackStretchyIcon'
	});

	$('#munObj .valueText').children('span').text($(this).text());
	closeList();

	$('#download').removeClass('disabled');
	$('#download').attr('href', munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].link);

	yMap.geoObjects.removeAll();

	if (munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].coord == undefined) {
		munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].circles.forEach(function(item) {
			circleCollection.add(new ymaps.Circle([item, 30]));
			pointCollection.add(new ymaps.Placemark(item, {
    			iconContent: "Вход"
    		}));
		});
	} else {
		munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].circles.forEach(function(item) {
			circleCollection.add(new ymaps.Circle([item, 30]));
			pointCollection.add(new ymaps.Placemark(item, {
    			iconContent: "Вход"
    		}));
		});
		circleCollection.add(new ymaps.Polygon([munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].coord]));
	}

	yMap.geoObjects.add(circleCollection).add(pointCollection);
	yMap.setBounds(circleCollection.getBounds(), {
		checkZoomRange:true
	}).then(function() {
		if (map.getZoom() > 10)
			map.setZoom(10);
	});
});

$(document).mouseup(function (e){
	var div = $("#munForm");
	if (!div.is(e.target)
	    && div.has(e.target).length === 0) {
		closeList();
	}
});

$(document).mouseup(function (e){
	var div = $("#munObj");
	if (!div.is(e.target)
	    && div.has(e.target).length === 0) {
		closeList();
	}
});

//Матан, геодезия, геометрия
//Оказалось, что в соотвествуии с действующим законодательством следубщий код не нужен. Но лучше оставлю.
/*
function resizePoly(arrCoord) {
	let lineCoordArray = [], bigPolyCoordLine = [], angleObj = [];

	arrCoord.forEach(function (item, i) {
		lineCoordArray.push(
			(i < arrCoord.length - 1) ?
			[item, arrCoord[i + 1]] :
			[item, arrCoord[0]]
		);
	});

	lineCoordArray.forEach(function(item) {
		angleObj.push({
			angle: getDirection(item, 30)[0],
			direction: getDirection(item, 30)[1],
			points: item
		});
	});

	angleObj.forEach(function(item, i) {
		if (i == angleObj.length - 1) {
			bigPolyCoordLine = bigPolyCoordLine.concat(roundAngle(item.points[1], item.direction, angleObj[0].direction, item.angle, angleObj[0].angle));
		} else {
			bigPolyCoordLine = bigPolyCoordLine.concat(roundAngle(item.points[1], item.direction, angleObj[i + 1].direction, item.angle, angleObj[i + 1].angle));
		}
	});

	bigPolyCoordLine = crossingLine(bigPolyCoordLine);

	mapPoly.geometry.setCoordinates([bigPolyCoordLine]);
}

function crossingLine(bigPolyCoordLine, i = 0) {
	for (i = 0; i < bigPolyCoordLine.length - 1; i++) {
		let x1 = Number(bigPolyCoordLine[i][0]),
			y1 = Number(bigPolyCoordLine[i][1]),
			x2 = Number(bigPolyCoordLine[i + 1][0]),
			y2 = Number(bigPolyCoordLine[i + 1][1]);

		for (let j = i + 2; j < bigPolyCoordLine.length - 1; j++) {
			let x3 = Number(bigPolyCoordLine[j][0]),
				y3 = Number(bigPolyCoordLine[j][1]),
				x4 = Number(bigPolyCoordLine[j + 1][0]),
				y4 = Number(bigPolyCoordLine[j + 1][1]);

			let d = ((x1 - x2) * (y4 - y3)) - ((y1 - y2) * (x4 - x3)),
				da = (((x1 - x3) * (y4 - y3)) - ((y1 - y3) * (x4 - x3))),
				db = (((x1 - x2) * (y1 - y3)) - ((y1 - y2) * (x1 - x3))),
				ta = da / d,
				tb = db / d,
				x, y;

			if (ta >= 0 && ta <= 1 && tb >= 0 && tb <= 1) {
				x = x1 + (ta * (x2 - x1));
				y = y1 + (ta * (y2 - y1));

				bigPolyCoordLine.splice(i, j - i + 1);
				bigPolyCoordLine.splice(i, 0, [x, y])

				crossingLine(bigPolyCoordLine, i)
			}
		}
	}
	return bigPolyCoordLine;
}

function getCenterLinePoint(twoPointsArray) {
	return [((twoPointsArray[0][0] + twoPointsArray[1][0]) / 2), ((twoPointsArray[0][1] + twoPointsArray[1][1]) / 2)];
}

function getAngle(twoPointArray) {
	let centerPoint, endPoint;

	if (twoPointArray[0][1] < twoPointArray[1][1]) {
		centerPoint = {
			x: twoPointArray[0][0],
			y: twoPointArray[0][1]
		}

		endPoint = {
			x: twoPointArray[1][0],
			y: twoPointArray[1][1]
		}
	} else {
		centerPoint = {
			x: twoPointArray[1][0],
			y: twoPointArray[1][1]
		}

		endPoint = {
			x: twoPointArray[0][0],
			y: twoPointArray[0][1]
		}
	}

	let distanceX = ymaps.coordSystem.geo.getDistance([centerPoint.x, centerPoint.y], [endPoint.x, centerPoint.y]),
		distanceY = ymaps.coordSystem.geo.getDistance([centerPoint.x, centerPoint.y], [centerPoint.x, endPoint.y]);

	if ((centerPoint.x < endPoint.x) && (centerPoint.y < endPoint.y))
		return Math.atan2(distanceY, distanceX) + (Math.PI / 2);

	if ((centerPoint.x > endPoint.x) && (centerPoint.y < endPoint.y))
		return (Math.PI / 2) - Math.atan2(distanceY, distanceX);
}

function getDirection(item, distance) {
	let centerLinePoint = getCenterLinePoint(item),
		direction = getAngle(item);

	if (mapPoly.geometry.contains(ymaps.coordSystem.geo.solveDirectProblem(centerLinePoint, [Math.cos(direction), Math.sin(direction)], 1).endPoint))
		return [direction, -distance];
	else
		return [direction, distance];
}

function roundAngle(centerPoint, directionStart, directionEnd, angleStart, angleEnd) {
	let roundPointsArray = [];

	if (directionStart == directionEnd) {
		for (let i = angleStart; i > angleEnd; i -= (Math.PI / 45)) {
			roundPointsArray.push(ymaps.coordSystem.geo.solveDirectProblem(centerPoint, [Math.cos(i), Math.sin(i)], directionStart).endPoint);
		}
	} else {
		for (let i = angleStart; i > 0; i -= (Math.PI / 45)) {
			roundPointsArray.push(ymaps.coordSystem.geo.solveDirectProblem(centerPoint, [Math.cos(i), Math.sin(i)], directionStart).endPoint);
		}
		for (let i = Math.PI; i > angleEnd; i -= (Math.PI / 45)) {
			roundPointsArray.push(ymaps.coordSystem.geo.solveDirectProblem(centerPoint, [Math.cos(i), Math.sin(i)], directionEnd).endPoint);
		}
	}

	return roundPointsArray;
}*/