let munObjData = {
	"Муниципальное образование «Боброво-Лявленское»":{
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Кузьмино»":{
			"circles":[[64.384133, 40.952229]],
			"link":"objects/1. Боброво-Лявленское-/1 ФАП Кузьмино+.docx"
		},
		"ГБСУ АО «Трепузовский психоневрологический интернат»":{
			"circles":[[64.364541, 41.057305]],
			"coord":[[64.364541, 41.057305], [64.364222, 41.055939], [64.363499, 41.053911], [64.362841, 41.055481], [64.361703, 41.059022], [64.361836, 41.059599], [64.362404, 41.060254], [64.362905, 41.059904], [64.363384, 41.059266], [64.363324, 41.059022]],
			"link":"objects/1. Боброво-Лявленское-/2 Трепузовский интернат+.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Лявля»":{
			"circles":[[64.377379, 41.023105]],
			"link":"objects/1. Боброво-Лявленское-/3 ФАП Лявля+.docx"
		},
		"Врачебная амбулатория \"Боброво\"":{
			"circles":[[64.356268, 41.152880]],
			"link":"objects/1. Боброво-Лявленское-/4 Амбулатория Боброво+.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Косково»":{
			"circles":[[64.347224, 41.353134]],
			"link":"objects/1. Боброво-Лявленское-/5 ФАП Косково+.docx"
		},
		"МБОУ «Бобровская СШ» ":{
			"circles":[[64.355401, 41.159310], [64.355283, 41.159310], [64.355032, 41.159310], [64.354362, 41.158999], [64.355018, 41.160732]],
			"coord":[[64.355762, 41.159231], [64.355622, 41.159263], [64.355064, 41.159306], [64.354316, 41.158972], [64.354197, 41.160351], [64.355657, 41.161048]],
			"link":"objects/1. Боброво-Лявленское-/6 Бобровская СШ+.docx"
		},
		"МБОУ «Бобровская СОШ» филиал Лявленская начальная школа-детский сад ":{
			"circles":[[64.385939, 41.027266], [64.386150, 41.028843], [64.385347, 41.028103]],
			"coord":[[64.385971, 41.027266], [64.385888, 41.027244], [64.385340, 41.028001], [64.385389, 41.028693], [64.386213, 41.028886], [64.386255, 41.028586], [64.386252, 41.028280]],
			"link":"objects/1. Боброво-Лявленское-/7 Детский сад Лявля+.docx"
		},
		"Хоккейная площадка":{
			"circles":[[64.355419, 41.153510]],
			"coord":[[64.355472, 41.153518], [64.355058, 41.153390], [64.355024, 41.153449], [64.354995, 41.153888], [64.355028, 41.153980], [64.355430, 41.154114], [64.355467, 41.154065], [64.355505, 41.153588]],
			"link":"objects/1. Боброво-Лявленское-/8 Хоккейная площадка Боброво+.docx"
		},
		"Волебольная площадка":{
			"circles":[[64.384470, 41.023234]],
			"coord":[[64.384468, 41.023186], [64.384146, 41.023170], [64.384241, 41.023674], [64.384473, 41.023301]],
			"link":"objects/1. Боброво-Лявленское-/9 Волебольная площадка у ДК д. Новинки+.docx"
		},
		"Тренажерный зал":{
			"circles":[[64.384528, 41.023290]],
			"link":"objects/1. Боброво-Лявленское-/10 Тренажерный зал в ДК д. Новинки+.docx"
		}
	},
	"Муниципальное образование «Заостровское»":{
		"Филиал ГБУЗ «Приморская ЦРБ» «Заостровская участковая больница»":{
			"circles":[[64.480224, 40.507131]],
			"coord":[[64.480918, 40.504770], [64.480014, 40.505232], [64.480199, 40.507115], [64.480278, 40.507120], [64.480909, 40.506584], [64.480935, 40.506369], [64.481055, 40.506321]],
			"link":"objects/2. Заостровское/1. Заостровская больница+.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Луговой»":{
			"circles":[[64.510257, 40.433651]],
			"link":"objects/2. Заостровское/2. ФАП п. Луговой+.docx"
		},
		"МБОУ «Заостровская СШ» Структурное подразделение «Детский сад с. Заостровье»":{
			"circles":[[64.482480, 40.506837]],
			"coord":[[64.482429, 40.505271], [64.481802, 40.505545], [64.481894, 40.507106], [64.482459, 40.506966], [64.482503, 40.506741]],
			"link":"objects/2. Заостровское/3. Детский сад Заостровье+.docx"
		},
		"МБОУ «Заостровская СШ» (здание начальной школы)":{
			"circles":[[64.481427, 40.507465], [64.481360, 40.509455]],
			"coord":[[64.481624, 40.507605], [64.481114, 40.507293], [64.480909, 40.509171], [64.481411, 40.509461]],
			"link":"objects/2. Заостровское/4. Начальная школа. Заостровье+.docx"
		},
		"МБОУ «Заостровская СШ» ":{
			"circles":[[64.481534, 40.511470], [64.480783, 40.510091], [64.480150, 40.513867]],
			"coord":[[64.481519, 40.511516], [64.481023, 40.510158], [64.480641, 40.510062], [64.479472, 40.512253], [64.480067, 40.514099]],
			"link":"objects/2. Заостровское/5. Школа в д. Рикасово+.docx"
		},
		"Тренажерный зал":{
			"circles":[[64.484343, 40.506687]],
			"link":"objects/2. Заостровское/6. Тренажерный зал. Заостровье+.docx"
		}
	},
	"Муниципальное образование «Катунинское»":{
		"ГБУЗ АО «Приморская ЦРБ» Врачебная амбулатория «Катунино»":{
			"circles":[[64.389613, 40.625176]],
			"link":"objects/3. Катунинское/1 Амбулатория Катунино+.docx"
		},
		"Филиал ГБУЗ «Приморская ЦРБ» ФАП «Беломорье»":{
			"circles":[[64.292947, 40.892626]],
			"link":"objects/3. Катунинское/2 ФАП Беломорье+.docx"
		},
		"Учреждение «Базовый санаторий «Беломорье»":{
			"circles":[[64.292312, 40.888633], [64.293738, 40.890779], [64.294418, 40.892013]],
			"coord":[[64.295690, 40.886292], [64.294153, 40.886968], [64.292252, 40.888567], [64.294903, 40.892831], [64.295867, 40.889945], [64.296045, 40.887852]],
			"link":"objects/3. Катунинское/3 Санаторий Беломорье+.docx"
		},
		"МБОУ «Катунинская СШ» (основная школа)":{
			"circles":[[64.391430, 40.623908], [64.392214, 40.624422], [64.393272, 40.623210]],
			"coord":[[64.392795, 40.622148], [64.392503, 40.622127], [64.392233, 40.622749], [64.391523, 40.623479], [64.391430, 40.623908], [64.392749, 40.624785], [64.392935, 40.624863], [64.393118, 40.624838], [64.393095, 40.624082], [64.393124, 40.624063], [64.393110, 40.623884], [64.393217, 40.623843], [64.393272, 40.623210]],
			"link":"objects/3. Катунинское/4 Катунинская СШ_осн_школа+.docx"
		},
		"МБОУ «Катунинская СШ» (начальная школа)":{
			"circles":[[64.388362, 40.630602]],
			"link":"objects/3. Катунинское/5 Катунинская СШ - начальная шк+.docx"
		},
		"Структурное подразделение «Детский сад п.Катунино» МБОУ «Катунинская СШ»":{
			"circles":[[64.389984, 40.624618]],
			"coord":[[64.390460, 40.624414], [64.390308, 40.624299], [64.390346, 40.623969], [64.390096, 40.623757], [64.389887, 40.625377], [64.390338, 40.625323]],
			"link":"objects/3. Катунинское/6 Детсад Катунино+.docx"
		},
		"Филиал «Детский сад д.Лахта» МБОУ «Катунинская СШ»":{
			"circles":[[64.394534, 40.617809], [64.394993, 40.618603]],
			"coord":[[64.395079, 40.617139], [64.394754, 40.617128], [64.394550, 40.617418], [64.394541, 40.617906], [64.394807, 40.618566], [64.395130, 40.618614], [64.395281, 40.618249], [64.395311, 40.617847]],
			"link":"objects/3. Катунинское/7 Детсад Лахта+.docx"
		},
		"МБУ ДО «Приморская детская школа искусств»":{
			"circles":[[64.389708, 40.624430]],
			"link":"objects/3. Катунинское/8 ДШИ+.docx"
		}
	},
	"Муниципальное образование «Лисестровское»":{
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Лисестровское»":{
			"circles":[[64.464608, 40.638100]],
			"link":"objects/4. Лисестровское-/1. ФАП Лисестровское+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Васьково»":{
			"circles":[[64.413765, 40.460864]],
			"link":"objects/4. Лисестровское-/2. ФАП Васьково+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Ширшинский ЗВЕРОСОВХОЗ»":{
			"circles":[[64.410135, 40.741568], [64.410139, 40.742045], [64.409597, 40.741477]],
			"coord":[[64.410137, 40.741463], [64.409568, 40.741474], [64.409570, 40.742614], [64.410140, 40.742614]],
			"link":"objects/4. Лисестровское-/3. ФАП Ширшинский зверосовхоз+.docx"
		},
		"ГБСУ АО «Ширшинский психоневрологический интернат»":{
			"circles":[[64.413231, 40.753770], [64.413158, 40.755130]],
			"coord":[[64.414046, 40.753195], [64.414017, 40.753187], [64.412994, 40.753938], [64.413425, 40.756907], [64.414752, 40.755921], [64.414639, 40.755055], [64.414308, 40.755280]],
			"link":"objects/4. Лисестровское-/4. Ширшинский интернат+.docx"
		},
		"Филиал «Детский сад п.Ширшинский» МБОУ «Катунинская СШ»":{
			"circles":[[64.410135, 40.741568], [64.410139, 40.742045], [64.409597, 40.741477]],
			"coord":[[64.410137, 40.741463], [64.409568, 40.741474], [64.409570, 40.742614], [64.410140, 40.742614]],
			"link":"objects/4. Лисестровское-/5. Ширшинский детсад+.docx"
		},
		"МБОУ «Васьковская СШ» (основное здание)":{
			"circles":[[64.412150, 40.453559], [64.412366, 40.454213]],
			"link":"objects/4. Лисестровское-/6.1 Васьковская СШ_осн_зд+.docx"
		},
		"МБОУ «Васьковская СШ» (начальная школа)":{
			"circles":[[64.409850, 40.454958]],
			"link":"objects/4. Лисестровское-/6.2. Васьковская СШ_начальная шк+.docx"
		},
		"Структурное подразделение «Детский сад п. Васьково» МБОУ «Васьковская СШ»":{
			"circles":[[64.412576, 40.464072]],
			"coord":[[64.412241, 40.462190], [64.411739, 40.462886], [64.411980, 40.463911], [64.412556, 40.464262], [64.412601, 40.463991], [64.412619, 40.463702]],
			"link":"objects/4. Лисестровское-/7. Детсад Васьково+.docx"
		},
		"Филиал «Детская школа искусств п.Васьково» МБУ ДО «Приморская ДШИ»":{
			"circles":[[64.409850, 40.454958]],
			"link":"objects/4. Лисестровское-/8. ДШИ Васьково+.docx"
		},
		"Спортивная площадка":{
			"circles":[[64.413793, 40.453336]],
			"link":"objects/4. Лисестровское-/9. Спортплощадка Васьково+.docx"
		},
		"Футбольное поле Васьково":{
			"circles":[[64.412627, 40.454457], [64.412544, 40.454613]],
			"link":"objects/4. Лисестровское-/10. Футбольное поле Васьково+.docx"
		},
		"Спортивный зал":{
			"circles":[[64.413790, 40.453349]],
			"link":"objects/4. Лисестровское-/11. Спортзал+.docx"
		},
		"Футбольное поле Окулово":{
			"circles":[[64.464542, 40.636307]],
			"link":"objects/4. Лисестровское-/13. Футбольное поле Окулово+.docx"
		},
		"Аэропорт АО «2-ой Архангельский объединенный авиаотряд»":{
			"circles":[[64.442923, 40.429794]],
			"link":"objects/4. Лисестровское-/14. Аэропорт+.docx"
		},
		"Войсковая часть №10488 Ш":{
			"circles":[[64.445691, 40.705028], [64.439355, 40.706619], [64.442799, 40.717040]],
			"coord":[[64.447155, 40.704352], [64.445691, 40.705028], [64.442845, 40.705264], [64.441186, 40.705242], [64.439490, 40.705307], [64.438961, 40.709663], [64.439277, 40.711680], [64.443086, 40.713972], [64.442799, 40.717040], [64.444393, 40.716568], [64.445903, 40.715409], [64.447396, 40.713757]],
			"link":"objects/4. Лисестровское-/15. ВЧ 10488Ш+.docx"
		}
	},
	"Муниципальное образование «Островное»":{
		"Филиал ГБУЗ АО «Приморская ЦРБ»  ФАП «Вознесенье»":{
			"circles":[[64.571283, 40.341523]],
			"link":"objects/5. Островное/1. ФАП Вознесение+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ»  ФАП «Ластола»":{
			"circles":[[64.600311, 40.295031]],
			"link":"objects/5. Островное/2 ФАП Ластола+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ»  ФАП «Пустошь»":{
			"circles":[[64.585941, 40.438499], [64.586045, 40.438220]],
			"link":"objects/5. Островное/3. ФАП Пустошь+.docx"
		},
		"МБОУ «Ластольская СШ»":{
			"circles":[[64.598576, 40.286790], [64.598058, 40.287417]],
			"coord":[[64.598251, 40.284161], [64.597514, 40.285103], [64.598035, 40.287458], [64.598832, 40.286430]],
			"link":"objects/5. Островное/4. МБОУ Ластольская СШ+.docx"
		},
		"Структурное подразделение «Детский сад д. Ластола»  МБОУ \"Ластольская СШ\"":{
			"circles":[[64.598576, 40.286790], [64.598058, 40.287417]],
			"coord":[[64.598251, 40.284161], [64.597514, 40.285103], [64.598035, 40.287458], [64.598832, 40.286430]],
			"link":"objects/5. Островное/5. ДС Ластола+.docx"
		},
		"Филиал \"Пустошинская средняя школа - детский сад\"":{
			"circles":[[64.586046, 40.437838], [64.585668, 40.436486]],
			"coord":[[64.585736, 40.436375], [64.585251, 40.436955], [64.585586, 40.438430], [64.586054, 40.437899]],
			"link":"objects/5. Островное/6. Пустошь школа-сад+.docx"
		},
		"Филиал \"Вознесенская средняя школа - детский сад\"":{
			"circles":[[64.574256, 40.340684]],
			"link":"objects/5. Островное/7. Вознесение школа-сад+.docx"
		},
		"Помещение для занятия физкультурой":{
			"circles":[[64.589234, 40.439760], [64.589218, 40.440168]],
			"link":"objects/5. Островное/8. Помещение для занятия физкультурой д.Одиночка+.docx"
		}
	},
	"Муниципальное образование «Пертоминское»":{
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Пертоминск»":{
			"circles":[[64.794182, 38.409860]],
			"link":"objects/6. Пертоминское/1. ФАП Пертоминск+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Лопшеньга»":{
			"circles":[[64.972860, 37.690341]],
			"link":"objects/6. Пертоминское/2. ФАП Лопшеньга+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Уна-Луда»":{
			"circles":[[64.643715, 38.152048]],
			"link":"objects/6. Пертоминское/3 ФАП Уна_Луда+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Летняя Золотица»":{
			"circles":[[64.951865, 36.822891]],
			"link":"objects/6. Пертоминское/5. ФАП Летняя Золотица+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Пушлахта»":{
			"circles":[[64.810013, 36.575437]],
			"link":"objects/6. Пертоминское/6. ФАП Пушлахта+.docx"
		},
		"МБОУ «Пертоминская СШ»":{
			"circles":[[64.792396, 38.416993], [64.792346, 38.416382]],
			"link":"objects/6. Пертоминское/7. Пертоминская СШ+.docx"
		},
		"Структурное подразделение «Детский сад п.Пертоминск» МБОУ «Пертоминская СШ»":{
			"circles":[[64.796873, 38.404987], [64.796278, 38.403539]],
			"coord":[[64.797206, 38.404698], [64.796507, 38.405396], [64.796223, 38.403615], [64.796914, 38.402928]],
			"link":"objects/6. Пертоминское/8. Пертоминский ДС+.docx"
		},
		"Филиал «Лудская начальная школа» МБОУ «Пертоминская СШ»":{
			"circles":[[64.643705, 38.151920]],
			"coord":[[64.644119, 38.152317], [64.643825, 38.151727], [64.643701, 38.151899], [64.643613, 38.152135], [64.643944, 38.152832]],
			"link":"objects/6. Пертоминское/9. Лудская нач_школа+.docx"
		},
		"МБОУ «Летне-Золотицкая ОШ»":{
			"circles":[[64.952779, 36.822313], [64.952784, 36.822528], [64.952675, 36.822420]],
			"link":"objects/6. Пертоминское/10. Летне Золотицкая ОШ+.docx"
		},
		"Структурное подразделение «Детский сад д. Летняя Золотица»":{
			"circles":[[64.952552, 36.823493], [64.952415, 36.823407]],
			"link":"objects/6. Пертоминское/11. Летне Золотицкая ОШ+.docx"
		},
		"МБОУ «Лопшеньгская ОШ»":{
			"circles":[[64.976020, 37.690784], [64.975224, 37.690459]],
			"coord":[[64.976405, 37.690834], [64.976428, 37.689375], [64.975447, 37.689281], [64.975256, 37.689763], [64.975247, 37.690652]],
			"link":"objects/6. Пертоминское/12. Лопшеньгская ОШ+.docx"
		},
		"Структурное подразделение «Пришкольный интернат» МБОУ «Лопшеньгская ОШ»":{
			"circles":[[64.976569, 37.690513]],
			"link":"objects/6. Пертоминское/13. Лопшеньгский интернат+.docx"
		},
		"Структурное подразделение «Детский сад д.Лопшеньга» МБОУ «Лопшеньгская ОШ»":{
			"circles":[[64.976020, 37.690784], [64.975224, 37.690459]],
			"coord":[[64.976405, 37.690834], [64.976428, 37.689375], [64.975251, 37.689257], [64.975247, 37.690652]],
			"link":"objects/6. Пертоминское/14. Лошеньга ДС+.docx"
		},
		"Спортивная площадка для футбола и волейбола":{
			"circles":[[64.976020, 37.690784], [64.975224, 37.690459], [64.976569, 37.690513]],
			"coord":[[64.976405, 37.690834], [64.976428, 37.689375], [64.975251, 37.689257], [64.975247, 37.690652]],
			"link":"objects/6. Пертоминское/15. Спортплощадка+.docx"
		},
		"Аэропорт АО «2-ой Архангельский объединенный авиаотряд» п. Пертоминск":{
			"circles":[[64.789502, 38.421572]],
			"link":"objects/6. Пертоминское/16. Аэропорт Пертоминск+.docx"
		},
		"Аэропорт АО «2-ой Архангельский объединенный авиаотряд» д. Летняя Золотица":{
			"circles":[[64.953189, 36.822120]],
			"link":"objects/6. Пертоминское/17. Аэропорт Летняя Золотица+.docx"
		},
		"Аэропорт АО «2-ой Архангельский объединенный авиаотряд» д. Лопшеньга":{
			"circles":[[64.976731, 37.692451]],
			"link":"objects/6. Пертоминское/18. Аэропорт Лопшеньга+.docx"
		}
	},
	"Муниципальное образование «Приморское»":{
		"ГБУЗ «Приморская ЦРБ» Врачебная амбулатория «Рикасиха» ":{
			"circles":[[64.537463, 40.169579], [64.536489, 40.170129]],
			"coord":[[64.537449, 40.169509], [64.536746, 40.168785], [64.536355, 40.170910], [64.537202, 40.171738], [64.537504, 40.169700]],
			"link":"objects/7. Приморское/1. Амбулатория Рикасиха+.docx"
		},
		"МБОУ «Приморская СШ» (здание школы)":{
			"circles":[[64.538090, 40.164631], [64.537238, 40.166552]],
			"coord":[[64.538457, 40.164991], [64.537585, 40.164133], [64.537164, 40.166482], [64.537852, 40.167153], [64.537919, 40.167083], [64.538284, 40.165146], [64.538402, 40.165238]],
			"link":"objects/7. Приморское/2.1. Основная школа Рикасиха+.docx"
		},
		"МБОУ «Приморская СШ» (здание начальной школы)":{
			"circles":[[64.538069, 40.163660]],
			"link":"objects/7. Приморское/2.2. Начальная  школа Рикасиха+.docx"
		},
		"МБОУ «Приморская СШ» Структурное подразделение «Детский сад д. Рикасиха»":{
			"circles":[[64.537463, 40.169579], [64.536489, 40.170129]],
			"coord":[[64.537449, 40.169509], [64.536746, 40.168785], [64.536355, 40.170910], [64.537202, 40.171738], [64.537504, 40.169700]],
			"link":"objects/7. Приморское/3. Детский сад Рикасиха+.docx"
		},
		"МБОУ «Приморская СШ» филиал «Лайдокский детский сад»":{
			"circles":[[64.534047, 40.251267], [64.533448, 40.251256]],
			"coord":[[64.534046, 40.251154], [64.533454, 40.251082], [64.533448, 40.251302], [64.533462, 40.251310], [64.533452, 40.251581], [64.533441, 40.251578], [64.533469, 40.251717], [64.533499, 40.251744], [64.533485, 40.251838], [64.533726, 40.252034], [64.534040, 40.251481]],
			"link":"objects/7. Приморское/4. Детский сад Лайский Док+.docx"
		},
		"МБУДО «Приморская ДЮСШ»":{
			"circles":[[64.537927, 40.159456]],
			"link":"objects/7. Приморское/5  Приморская ДЮСШ+.docx"
		},
		"МБУДО «Приморская ДЮСШ» помещение для занятия физкультурой":{
			"circles":[[64.537927, 40.159456]],
			"link":"objects/7. Приморское/6  Приморская ДЮСШ+.docx"
		},
		"Спортивная площадка «Городок здоровья»":{
			"circles":[[64.533197, 40.249886]],
			"coord":[[64.533207, 40.249823], [64.533059, 40.249776], [64.533019, 40.250395], [64.533136, 40.250417], [64.533166, 40.250047], [64.533191, 40.249988]],
			"link":"objects/7. Приморское/7. Спортивная площадка Городок здоровья+.docx"
		},
		"Хоккейный корт «Дельфин»":{
			"circles":[[64.533486, 40.250975]],
			"link":"objects/7. Приморское/8. Хоккейный корт Дельфин+.docx"
		},
		"Хоккейный корт":{
			"circles":[[64.537128, 40.167098]],
			"link":"objects/7. Приморское/9. Хоккейный корт Рикасиха+.docx"
		},
		"Футбольная площадка":{
			"circles":[[64.536942, 40.168810]],
			"coord":[[64.537284, 40.168700], [64.536935, 40.168354], [64.536871, 40.168727], [64.537208, 40.169078]],
			"link":"objects/7. Приморское/10. Футбольная площадка Рикасиха+.docx"
		},
		"Войсковая часть 92485":{
			"circles":[[64.520962, 40.145106]],
			"link":"objects/7. Приморское/11. ВЧ 92485+.docx"
		},
		"Волейбольная площадка":{
			"circles":[[64.537927, 40.159456]],
			"coord":[[64.537673, 40.159161], [64.537616, 40.159110], [64.537560, 40.159429], [64.537622, 40.159480]],
			"link":"objects/7. Приморское/Волейбольная площадка Рикасиха+.docx"
		},
		"Стадион":{
			"circles":[[64.537859, 40.167752]],
			"link":"objects/7. Приморское/Стадион Рикасиха+.docx"
		}
	},
	"Муниципальное образование «Сельское поселение «Соловецкое»":{
		"ГБУЗ АО «АОКБ» филиал Соловецкая участковая больница":{
			"circles":[[65.021737, 35.708911], [65.021602, 35.710139]],
			"link":"objects/8. Соловецкое/1. Соловецкая больница+.docx"
		},
		"МБОУ «Соловецкая СШ»":{
			"circles":[[65.021238, 35.704434]],
			"link":"objects/8. Соловецкое/2. Соловецкая школа+.docx"
		},
		"Структурное подразделение «Детский сад п. Соловецкий»":{
			"circles":[[65.021771, 35.705032]],
			"link":"objects/8. Соловецкое/3. Соловецкий садик+.docx"
		},
		"Хоккейный корт":{
			"circles":[[65.028832, 35.700741]],
			"link":"objects/8. Соловецкое/4. Хоккейный корт+.docx"
		},
		"Спортивная площадка":{
			"circles":[[65.021394, 35.704865]],
			"link":"objects/8. Соловецкое/5. Спортивная площадка+.docx"
		},
		"Помещение для занятий физкультурой":{
			"circles":[[65.026697, 35.714436], [65.026850, 35.714796], [65.026812, 35.715359]],
			"link":"objects/8. Соловецкое/6. Помещение для занятий физкультурой+.docx"
		},
		"Производственные объекты ООО «Архангельские региональные авиаперевозки»":{
			"circles":[[65.029882, 35.723321]],
			"link":"objects/8. Соловецкое/7 Аэропорт+.docx"
		},
		"Производственные объекты ОАО «АрхоблЭнерго» филиал «Соловецкий»":{
			"circles":[[65.020786, 35.714765], [65.021422, 35.714531], [65.020906, 35.717093]],
			"coord":[[65.021994, 35.714714], [65.020850, 35.714320], [65.020747, 35.715387], [65.020602, 35.716149], [65.020625, 35.716642], [65.020763, 35.717045], [65.020906, 35.717093], [65.021392, 35.718397], [65.022167, 35.717399]],
			"link":"objects/8. Соловецкое/8. Архоблэнерго+.docx"
		}
	},
	"Муниципальное образование «Талажское»":{
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Талаги»":{
			"circles":[[64.622471, 40.669684]],
			"link":"objects/9. Талажское-/1. ГБУЗ ФАП Талаги+.docx"
		},
		"ГБУЗ АО «Архангельская клиническая психиатрическая больница-1»":{
			"circles":[[64.626219, 40.644163], [64.626384, 40.647462]],
			"link":"objects/9. Талажское-/2. ГБУЗ АКПБ 1+.docx"
		},
		"ГБУЗ АО «Архангельская клиническая психиатрическая больница-2»":{
			"circles":[[64.627623, 40.690969]],
			"link":"objects/9. Талажское-/3. ГБУЗ АКПБ 2+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Повракула»":{
			"circles":[[64.618113, 40.591173]],
			"link":"objects/9. Талажское-/5. ГБУЗ ФАП Повракульская+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Верхняя Золотица»":{
			"circles":[[65.690260, 40.370133], [65.690154, 40.371184]],
			"link":"objects/9. Талажское-/6. ГБУЗ ФАП В.Золотица+.docx"
		},
		"Филиал ГБУЗ АО «Приморская ЦРБ» ФАП «Нижняя Золотица»":{
			"circles":[[65.688543, 40.182798]],
			"link":"objects/9. Талажское-/7. ГБУЗ ФАП Н.Золотица+.docx"
		},
		"МБОУ «Талажская СШ»":{
			"circles":[[64.625340, 40.670830], [64.624132, 40.670787]],
			"coord":[[64.625355, 40.669500], [64.624139, 40.669447], [64.624173, 40.672107], [64.625343, 40.672268]],
			"link":"objects/9. Талажское-/8. Талаги школа+.docx"
		},
		"МБОУ «Талажская СШ» Структурное подразделение «Детский сад п. Талаги»":{
			"circles":[[64.623480, 40.669805], [64.622817, 40.669298], [64.623488, 40.669231]],
			"coord":[[64.623473, 40.668574], [64.622787, 40.668563], [64.622852, 40.669939], [64.623217, 40.669856], [64.623246, 40.670145], [64.623386, 40.670215], [64.623488, 40.669751]],
			"link":"objects/9. Талажское-/9. Детский сад Талаги+.docx"
		},
		"МБОУ «Талажская СШ» Филиал «Повракульская начальная школа - детский сад»":{
			"circles":[[64.617861, 40.588806], [64.618272, 40.587330], [64.617616, 40.587467], [64.617541, 40.588764], [64.618269, 40.588755]],
			"coord":[[64.618567, 40.587465], [64.618098, 40.587237], [64.617198, 40.587762], [64.617140, 40.588741], [64.617861, 40.588806], [64.618269, 40.588755], [64.618621, 40.587741]],
			"link":"objects/9. Талажское-/10. школа - детский сад Повракульскя+.docx"
		},
		"МБОУ «Талажская СШ» Филиал «Верхне - Золотицкая основная школа - детский сад»":{
			"circles":[[65.690716, 40.373047]],
			"link":"objects/9. Талажское-/11. школа - детский сад Верхняя Золотица+.docx"
		},
		"МБОУ «Патракеевская СШ»":{
			"circles":[[64.963167, 40.391216]],
			"coord":[[64.964031, 40.389424], [64.963795, 40.389896], [64.963404, 40.389885], [64.963422, 40.390722], [64.963158, 40.390744], [64.963163, 40.391602], [64.963890, 40.392278], [64.964127, 40.392224], [64.964213, 40.391763], [64.964218, 40.390637]],
			"link":"objects/9. Талажское-/12. Патракеевская школа+.docx"
		},
		"МБОУ «Патракеевская  СШ»Структурное подразделение «Детский сад д. Патракеевка»":{
			"circles":[[64.963167, 40.391216]],
			"coord":[[64.964031, 40.389424], [64.963795, 40.389896], [64.963404, 40.389885], [64.963422, 40.390722], [64.963158, 40.390744], [64.963163, 40.391602], [64.963890, 40.392278], [64.964127, 40.392224], [64.964213, 40.391763], [64.964218, 40.390637], [64.964192, 40.389800]],
			"link":"objects/9. Талажское-/13. Патракеевская детский сад+.docx"
		},
		"Тренажерный зал":{
			"circles":[[64.623494, 40.667626]],
			"radius":[20],
			"link":"objects/9. Талажское-/14. тренажерный зал Талаги+.docx"
		},
		"Футбольная площадка":{
			"circles":[[64.624187, 40.669023]],
			"link":"objects/9. Талажское-/15. футбольная площадка Талаги+.docx"
		},
		"Поле хоккейное":{
			"circles":[[64.628550, 40.641002]],
			"link":"objects/9. Талажское-/16. поле хоккейное Талаги+.docx"
		},
		"Производственные объекты - карьер на трубке «Архангельская»":{
			"circles":[[65.275858, 41.029360]],
			"link":"objects/9. Талажское-/17. Карьер на трубке Архангельская+.docx"
		},
		"Производственные объекты (карьер на трубке «Карпинского-1»)":{
			"circles":[[65.275858, 41.029360]],
			"link":"objects/9. Талажское-/18. Карьер на трубке Карпинского_1+.docx"
		},
		"Группа резервуаров и сливно-наливных устройств":{
			"circles":[[64.623719, 40.662036]],
			"link":"objects/9. Талажское-/19. РСН_Терминалы+.docx"
		},
		"Производственные объекты (карьер на трубке «Архангельская» фабрика обогатительная, карьер на трубке «Карпинского-1», дизельная электростанция, резервуарный парк по хранению нефтепродуктов дизельной электростанции)":{
			"circles":[[65.275858, 41.029360]],
			"link":"objects/9. Талажское-/20. Севералмаз+.docx"
		},
		"Войсковая часть 21514 военный городов №65":{
			"circles":[[65.677040, 40.144079]],
			"coord":[[65.677257, 40.141407], [65.674921, 40.141493], [65.673921, 40.143875], [65.674523, 40.148231], [65.675691, 40.147716], [65.677071, 40.146600], [65.677018, 40.144519]],
			"link":"objects/9. Талажское-/21. ВЧ 21514+.docx"
		}
	},
	"Муниципальное образование «Уемское»":{
		"ГБУЗ АО «Приморская ЦРБ» Уемская районная больница":{
			"circles":[[64.473555, 40.864513]],
			"link":"objects/10. Уемское/1. Уемская больница+.docx"
		},
		"МБОУ «Уемская СШ»":{
			"circles":[[64.478810, 40.842029], [64.478259, 40.843568]],
			"coord":[[64.479008, 40.840883], [64.478388, 40.840100], [64.478103, 40.840062], [64.477524, 40.842927], [64.478492, 40.843811]],
			"link":"objects/10. Уемское/2. Уемская школа+.docx"
		},
		"МБОУ «Уемская СШ» Структурное подразделение «Детский сад п. Уемский»":{
			"circles":[[64.473160, 40.868951]],
			"coord":[[64.473842, 40.869894], [64.473410, 40.868783], [64.473213, 40.868848], [64.472884, 40.869583], [64.472957, 40.869779], [64.472866, 40.870036], [64.472575, 40.869816], [64.472375, 40.870309], [64.473016, 40.871703], []],
			"link":"objects/10. Уемское/3. Детский сад Уемский+.docx"
		},
		"Филиал «Детская школа искусств п. Уемский» МБУ ДО «Приморская ДШИ»":{
			"circles":[[64.478820, 40.841968], [64.478240, 40.843583]],
			"coord":[[64.479008, 40.840883], [64.478388, 40.840100], [64.478103, 40.840062], [64.477524, 40.842927], [64.478492, 40.843811]],
			"link":"objects/10. Уемское/4. филиал Уемский ДШИ+.docx"
		},
		"ГБСУ АО «Приморский СРЦН «Радуга»":{
			"circles":[[64.471922, 40.872110]],
			"coord":[[64.472193, 40.871453], [64.471702, 40.872687], [64.471664, 40.872789], [64.472145, 40.873837], [64.472701, 40.872518]],
			"link":"objects/10. Уемское/5. Центр Радуга+.docx"
		},
		"Футбольная площадка":{
			"circles":[[64.474795, 40.863885]],
			"coord":[[64.475166, 40.863982], [64.474844, 40.863521], [64.474768, 40.863832], [64.475085, 40.864298]],
			"link":"objects/10. Уемское/6. Футбольная площадка Уемское+.docx"
		},
		"МБОУ «Уемская СШ» Структурное подразделение «Детский сад п. Уемский»":{
			"circles":[[64.473160, 40.868951]],
			"coord":[[64.473842, 40.869894], [64.473410, 40.868783], [64.473213, 40.868848], [64.472884, 40.869583], [64.472957, 40.869779], [64.472866, 40.870036], [64.472575, 40.869816], [64.472375, 40.870309], [64.473016, 40.871703]],
			"link":"objects/10. Уемское/7. Детский сад Уемский+.docx"
		},
		"Лыжный стадион им. В. С. Кузина":{
			"circles":[[64.462147, 40.943178]],
			"coord":[[64.462390, 40.943505], [64.462112, 40.943054], [64.462027, 40.941659], [64.460406, 40.939920], [64.459684, 40.944786], [64.459262, 40.945829], [64.457345, 40.947181], [64.457345, 40.947181], [64.453560, 40.965055], [64.451707, 40.964744], [64.449807, 40.963885], [64.449807, 40.963885], [64.449191, 40.966117], [64.450655, 40.973842], [64.458200, 40.983369], [64.459787, 40.982425], [64.464968, 40.979096], [64.469611, 40.970240], [64.469956, 40.961810], [64.467290, 40.954753]],
			"link":"objects/10. Уемское/8. Стадион. М. Корелы+.doc"
		}
	}
}

ymaps.ready(init);

var mapCircle,
	circleCollection = {},
	pointCollection = {};

function init() {
	yMap = new ymaps.Map("map", {
		center: [64.543235, 40.537195],
		zoom: 13,
		type: 'yandex#hybrid'
	});

	circleCollection = new ymaps.GeoObjectCollection({}, {
    	fillColor: "#FF000025",
	  	strokeColor: "#FF0000",
	   	strokeWidth: 2
	});
}

function createSelect(selectElement, objectData, addData = false) {
	selectElement.html('');
	Object.keys(objectData).forEach(function (item){
		selectElement.append($('<li>').text(item));
	});
}

function closeList(listEl = $('.selectElement ul'), currentEl = $('.valueText')) {
	currentEl.children('img').css('transform', 'rotate(0)');
	listEl.css('display', 'none');
	currentEl.removeClass('active');
}

function openList(listEl, currentEl) {
	currentEl.children('img').css('transform', 'rotate(180deg)');
	listEl.css('display', 'block');
	currentEl.addClass('active');
}

createSelect($('#munForm ul'), munObjData);

$('.valueText').on('click', function() {
	closeList();
	let listEl = $(this).parent().children('ul')

	if ($(this).hasClass('active'))
		closeList(listEl, $(this));
	else
		openList(listEl, $(this));
});

$('#munForm').on('click', 'li', function() {
	createSelect($('#munObj ul'), munObjData[$(this).text()]);
	$('#munForm .valueText').children('span').text($(this).text());
	closeList();
});

$('#munObj').on('click', 'li', function() {
	circleCollection = new ymaps.GeoObjectCollection({}, {
		fillColor: "#FF000025",
		strokeColor: "#FF0000",
		strokeWidth: 2
	});

	pointCollection = new ymaps.GeoObjectCollection({
		properties: {
			iconContent: "Азербайджан"
		}
	}, {
			preset: 'islands#blackStretchyIcon'
	});

	$('#munObj .valueText').children('span').text($(this).text());
	closeList();

	$('#download').removeClass('disabled');
	$('#download').attr('href', munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].link);

	yMap.geoObjects.removeAll();

	let radius = (munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].radius == undefined) ? 30 : munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].radius[0];

	if (munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].coord == undefined) {
		munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].circles.forEach(function(item) {
			circleCollection.add(new ymaps.Circle([item, radius]));
			pointCollection.add(new ymaps.Placemark(item, {
    			iconContent: "Вход"
    		}));
		});
	} else {
		munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].circles.forEach(function(item) {
			circleCollection.add(new ymaps.Circle([item, radius]));
			pointCollection.add(new ymaps.Placemark(item, {
    			iconContent: "Вход"
    		}));
		});
		circleCollection.add(new ymaps.Polygon([munObjData[$('#munForm .valueText span').text()][$('#munObj .valueText span').text()].coord]));
	}

	yMap.geoObjects.add(circleCollection).add(pointCollection);
	yMap.setBounds(circleCollection.getBounds(), {
		checkZoomRange:true
	}).then(function() {
		if (map.getZoom() > 10)
			map.setZoom(10);
	});
});

$(document).mouseup(function (e){
	var div = $("#munForm");
	if (!div.is(e.target)
	    && div.has(e.target).length === 0) {
		closeList();
	}
});

$(document).mouseup(function (e){
	var div = $("#munObj");
	if (!div.is(e.target)
	    && div.has(e.target).length === 0) {
		closeList();
	}
});

//Матан, геодезия, геометрия
//Оказалось, что в соотвествуии с действующим законодательством следубщий код не нужен. Но лучше оставлю.
/*
function resizePoly(arrCoord) {
	let lineCoordArray = [], bigPolyCoordLine = [], angleObj = [];

	arrCoord.forEach(function (item, i) {
		lineCoordArray.push(
			(i < arrCoord.length - 1) ?
			[item, arrCoord[i + 1]] :
			[item, arrCoord[0]]
		);
	});

	lineCoordArray.forEach(function(item) {
		angleObj.push({
			angle: getDirection(item, 30)[0],
			direction: getDirection(item, 30)[1],
			points: item
		});
	});

	angleObj.forEach(function(item, i) {
		if (i == angleObj.length - 1) {
			bigPolyCoordLine = bigPolyCoordLine.concat(roundAngle(item.points[1], item.direction, angleObj[0].direction, item.angle, angleObj[0].angle));
		} else {
			bigPolyCoordLine = bigPolyCoordLine.concat(roundAngle(item.points[1], item.direction, angleObj[i + 1].direction, item.angle, angleObj[i + 1].angle));
		}
	});

	bigPolyCoordLine = crossingLine(bigPolyCoordLine);

	mapPoly.geometry.setCoordinates([bigPolyCoordLine]);
}

function crossingLine(bigPolyCoordLine, i = 0) {
	for (i = 0; i < bigPolyCoordLine.length - 1; i++) {
		let x1 = Number(bigPolyCoordLine[i][0]),
			y1 = Number(bigPolyCoordLine[i][1]),
			x2 = Number(bigPolyCoordLine[i + 1][0]),
			y2 = Number(bigPolyCoordLine[i + 1][1]);

		for (let j = i + 2; j < bigPolyCoordLine.length - 1; j++) {
			let x3 = Number(bigPolyCoordLine[j][0]),
				y3 = Number(bigPolyCoordLine[j][1]),
				x4 = Number(bigPolyCoordLine[j + 1][0]),
				y4 = Number(bigPolyCoordLine[j + 1][1]);

			let d = ((x1 - x2) * (y4 - y3)) - ((y1 - y2) * (x4 - x3)),
				da = (((x1 - x3) * (y4 - y3)) - ((y1 - y3) * (x4 - x3))),
				db = (((x1 - x2) * (y1 - y3)) - ((y1 - y2) * (x1 - x3))),
				ta = da / d,
				tb = db / d,
				x, y;

			if (ta >= 0 && ta <= 1 && tb >= 0 && tb <= 1) {
				x = x1 + (ta * (x2 - x1));
				y = y1 + (ta * (y2 - y1));

				bigPolyCoordLine.splice(i, j - i + 1);
				bigPolyCoordLine.splice(i, 0, [x, y])

				crossingLine(bigPolyCoordLine, i)
			}
		}
	}
	return bigPolyCoordLine;
}

function getCenterLinePoint(twoPointsArray) {
	return [((twoPointsArray[0][0] + twoPointsArray[1][0]) / 2), ((twoPointsArray[0][1] + twoPointsArray[1][1]) / 2)];
}

function getAngle(twoPointArray) {
	let centerPoint, endPoint;

	if (twoPointArray[0][1] < twoPointArray[1][1]) {
		centerPoint = {
			x: twoPointArray[0][0],
			y: twoPointArray[0][1]
		}

		endPoint = {
			x: twoPointArray[1][0],
			y: twoPointArray[1][1]
		}
	} else {
		centerPoint = {
			x: twoPointArray[1][0],
			y: twoPointArray[1][1]
		}

		endPoint = {
			x: twoPointArray[0][0],
			y: twoPointArray[0][1]
		}
	}

	let distanceX = ymaps.coordSystem.geo.getDistance([centerPoint.x, centerPoint.y], [endPoint.x, centerPoint.y]),
		distanceY = ymaps.coordSystem.geo.getDistance([centerPoint.x, centerPoint.y], [centerPoint.x, endPoint.y]);

	if ((centerPoint.x < endPoint.x) && (centerPoint.y < endPoint.y))
		return Math.atan2(distanceY, distanceX) + (Math.PI / 2);

	if ((centerPoint.x > endPoint.x) && (centerPoint.y < endPoint.y))
		return (Math.PI / 2) - Math.atan2(distanceY, distanceX);
}

function getDirection(item, distance) {
	let centerLinePoint = getCenterLinePoint(item),
		direction = getAngle(item);

	if (mapPoly.geometry.contains(ymaps.coordSystem.geo.solveDirectProblem(centerLinePoint, [Math.cos(direction), Math.sin(direction)], 1).endPoint))
		return [direction, -distance];
	else
		return [direction, distance];
}

function roundAngle(centerPoint, directionStart, directionEnd, angleStart, angleEnd) {
	let roundPointsArray = [];

	if (directionStart == directionEnd) {
		for (let i = angleStart; i > angleEnd; i -= (Math.PI / 45)) {
			roundPointsArray.push(ymaps.coordSystem.geo.solveDirectProblem(centerPoint, [Math.cos(i), Math.sin(i)], directionStart).endPoint);
		}
	} else {
		for (let i = angleStart; i > 0; i -= (Math.PI / 45)) {
			roundPointsArray.push(ymaps.coordSystem.geo.solveDirectProblem(centerPoint, [Math.cos(i), Math.sin(i)], directionStart).endPoint);
		}
		for (let i = Math.PI; i > angleEnd; i -= (Math.PI / 45)) {
			roundPointsArray.push(ymaps.coordSystem.geo.solveDirectProblem(centerPoint, [Math.cos(i), Math.sin(i)], directionEnd).endPoint);
		}
	}

	return roundPointsArray;
}*/